import React from 'react'
import Layout from './Layout'

export default {
  title: 'Example/Layout',
  component: Layout
}

export const Visible = {
  args: {
    children: [
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,      
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>,
      <p>Содержимое компонента.</p>]
  },
}